#======================================================================================
# Напишите программу, которая будет принимать на вход дробь и 
# показывать первую цифру дробной части числа.
#======================================================================================

number = float(input('Введите дробь: '))
result = int(number % 1 * 10)
if result == 0:
    print('Нет дробной части')
else:
    print(result)
