#======================================================================================
# Напишите программу, которая будет на вход принимать число N и 
# выводить числа от -N до N
#======================================================================================

number = int(input('Введите число: '))
list = []

for i in range(-number, number+1, 1):
    list.append(i)
print(list)