#======================================================================================
# Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z 
# для всех значений предикат.
#======================================================================================

xyz = ['X', 'Y', 'Z']
a = []

for i in range(3):
    a.append(input(f'Введите значение {xyz[i]}: '))
print(a)

for a[0] in [True,False]:
    for a[1] in [True,False]:
        for a[2] in [True,False]:
            print(a[0],'AND',a[1],'OR',a[2],'=',a[0] and a[1] or a[2])
