#======================================================================================
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем 
# первый и последний элемент, второй и предпоследний и т.д.
#======================================================================================

list = [2, 3, 5, 6]
result_list = []
counter = len(list) - 1


for i in range(0, int((len(list) + 1)/2), 1):
    result_list.append(list[i] * list[counter])
    counter-=1
print(result_list)