#======================================================================================
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу 
# между максимальным и минимальным значением дробной части элементов.
#======================================================================================

list = [1.1, 1.2, 3.1, 5.1, 10.01]
max = list[0]
min = list[0]

for i in range(0, len(list), 1):
    if (list[i] % 1) < min:
        min = list[i]
    elif (list[i] % 1) > max:
        max = list[i]
        
print(round(round((max % 1), 2) - round((min % 1), 2), 2))