#======================================================================================
# Реализуйте алгоритм нахождения(генерации) рандомного(случайного) числа.
# (Не используя библиотеки связанные с рандомом)
#======================================================================================
import datetime

date = datetime.datetime.now()
mils = date.microsecond
secs = date.second
random_number = int(mils / secs) % 100
print(random_number)
