#======================================================================================
# Задайте словарь из n чисел последовательности (1 + (1/n))^n и выведите на экран 
# их сумму.
#======================================================================================

import math


number = int(input('Введите число: '))
counter = 1
list = {}

for i in range(1, number + 1, 1):
    list[i] = round((1/i + 1)**2, 2)

print(list)

# Сделал все по условию, но с примером не сошлось, тк там есть ошибка)