#======================================================================================
# Напишите программу, в которой пользователь будет задавать две строки, а программа - 
# определять количество вхождений одной строки в другой.
#======================================================================================

str1 = input('Введите первую строку: ')
str2 = input('Введите вторую строку: ')
counter = 0
str1_arr = str1.split()

# for i in str1_arr:
#     if i.lower() == str2.lower():
#         counter += 1
# print(counter)

print(str1.count(str2)) # Alternative method count()