#======================================================================================
# Напишите программу, которая принимает на вход вещественное число и показывает сумму его 
# цифр.(Сделать для строки)
#======================================================================================

input = str(input('Введите число: '))
result = 0

for char in input:
    if char.isdigit():
        result += int(char)
print(result)