#======================================================================================
# Напишите программу, которая принимает на вход число N и выдаёт последовательность
#  из N членов.
#======================================================================================

counter = int(input('Введите число: '))
result = 1
list = []

for i in range(counter):
    list.append(result)
    result *= -3
print(list)
