# ======================================================================================
# Задана натуральная степень k. Сформировать случайным образом список коэффициентов 
# (значения от 0 до 100)* многочлена и записать в файл многочлен степени k.
# ======================================================================================
import random
import re


k = int(input('Введите значение степени для многочлена: '))
result = ''

while (k > 0):
    result += (str(random.randint(1, 101))) + '^' + (str(k)) + ' + '
    k -= 1


final = result[0:len(result) - 2] + ('= 0')

data = open('mnogochlen.txt', 'a')
data.write(final + '\n')
data.close()