# ======================================================================================
# Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности.
# Пример:
# - Ввод:[1,1,2,4,5,6,7,7,8], результат: [2,4,5,6,8]
# ======================================================================================

lst = [1, 1, 10, 2, 4, 5, 6, 7, 7, 8]
lst.sort()
result = []

# Работает только с отсортированными списками без вложенности,
# но условию задачи удолетворяет)

for i in lst:
    if i not in result:
        result.append(i) 
print(result)            
